# Python Fundamentals for Data Analysts
# 4.5: Data Consistency Checks

In [1]:

#Import the pandas, NumPy, and os libraries
import pandas as pd
import os


#Turn your project folder path into a string as outlined in the Exercise text.
path = r'C:\\Users\\mutta\\Documents\\Project 4\\' 

#Import the “orders.csv” data set into your notebook using the os library and 
vars_list = ['order_id', 'user_id', 'order_number', 'order_dow', 'order_hour_of_day', 'days_since_prior_order']

order_CSV = os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv')
product_CSV = os.path.join(path, '02 Data', 'Original Data', 'products.csv')

df_orders = pd.read_csv(order_CSV, index_col = False)
df_prods = pd.read_csv(product_CSV, index_col = False)

In [2]:
# If you haven’t performed the consistency checks covered in this 
# Exercise on your df_prods dataframe, do so now.
pd.options.display.float_format = '{:.2f}'.format
df_orders.round(2)

df_orders.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3421083.00,3421083.00,3421083.00,3421083.00,3421083.00,3214874.00
mean,1710542.00,102978.21,17.15,2.78,13.45,11.11
std,987581.74,59533.72,17.73,2.05,4.23,9.21
min,1.00,1.00,1.00,0.00,0.00,0.00
25%,855271.50,51394.00,5.00,1.00,10.00,4.00
50%,1710542.00,102689.00,11.00,3.00,13.00,7.00
75%,2565812.50,154385.00,23.00,5.00,16.00,15.00
max,3421083.00,206209.00,100.00,6.00,23.00,30.00

In [3]:
df_orders.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [4]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [5]:
df_prod_name_nan = df_prods[df_prods['product_name'].isnull() == True]
df_prod_name_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14   12.20
68             69          NaN        26              7   11.80
115           116          NaN        93              3   10.80
261           262          NaN       110             13   12.10
525           525          NaN       109             11    1.20
1511         1511          NaN        84             16   14.30
1780         1780          NaN       126             11   12.30
2240         2240          NaN        52              1   14.20
2586         2586          NaN       104             13   12.40
3159         3159          NaN       126             11   13.10
3230         3230          NaN       120             16   14.40
3736         3736          NaN        41              8   14.80
4283         4283          NaN        77              7   14.40
4790         4790          NaN        91             16   14.50
38187       38183          NaN        39             12   20.90
40444       40440          NaN       120             16   14.80

In [6]:
df_orders.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3421083.00,3421083.00,3421083.00,3421083.00,3421083.00,3214874.00
mean,1710542.00,102978.21,17.15,2.78,13.45,11.11
std,987581.74,59533.72,17.73,2.05,4.23,9.21
min,1.00,1.00,1.00,0.00,0.00,0.00
25%,855271.50,51394.00,5.00,1.00,10.00,4.00
50%,1710542.00,102689.00,11.00,3.00,13.00,7.00
75%,2565812.50,154385.00,23.00,5.00,16.00,15.00
max,3421083.00,206209.00,100.00,6.00,23.00,30.00

Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

>>"order_dow" column Orders day of the week has a minimum value of 0, and the maximum value contains 6.

>>The "order_hour_of_day" column contains an hour of the day values from 0 to 23.

>>"days_since_prior_order" has all positive values, with a minimum of 0 and a maximum of 30.

In [7]:
def validate_mixed_type_check(df):
    for col in df.columns.tolist():
      weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
      if len (df[weird]) > 0:
        print ('Column', col, ' contains mixed types')
      else:
        print('Column', col ,'  contains same data types')

In [8]:
# 3. validate_mixed_type_check(df_orders)
validate_mixed_type_check(df_orders)

Column order_id   contains same data types
Column user_id   contains same data types
Column order_number   contains same data types
Column orders_day_of_week   contains same data types
Column order_hour_of_day   contains same data types
Column days_since_prior_order   contains same data types

In [9]:
#validate_mixed_type_check(df_prods)
validate_mixed_type_check(df_prods)

Column product_id   contains same data types
Column product_name  contains mixed types
Column aisle_id   contains same data types
Column department_id   contains same data types
Column prices   contains same data types

In [10]:
#5.
#Run a check for missing values in your df_ords dataframe.
#In a markdown cell, report your findings and propose an explanation for any missing values you find.
df_orders.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [11]:
df_days_since_prior_order_nan = df_orders[df_orders['days_since_prior_order'].isnull() == True]
print('Total number of Nan cells in days_since_prior_order column is', df_days_since_prior_order_nan.shape[0] )

Total number of Nan cells in days_since_prior_order column is 206209

In [12]:
df_nan_order_id_not_1 = df_days_since_prior_order_nan[df_days_since_prior_order_nan['order_number'] != 1]
print('Total nan records which aren\'t first order', df_nan_order_id_not_1.shape[0] )

Total nan records which aren't first order 0

In [13]:
#
#Address the missing values using an appropriate method.
#In a markdown cell, explain why you used your method of choice.

print('Impute the nan values with 0 in days_since_prior_order as all records don\'t have any prior orders')
print('Filling Nan values with 0 won\'t make any much difference in records')
df_orders['days_since_prior_order'].fillna(0, inplace=True)

Impute the nan values with 0 in days_since_prior_order as all records don't have any prior orders
Filling Nan values with 0 won't make any much difference in records

In [14]:
print('After impute total nan records in days_since_prior_order is', df_orders['days_since_prior_order'].isnull().sum())

After impute total nan records in days_since_prior_order is 0

In [15]:
#Run a check for missing values in your df_prods dataframe.
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [16]:
df_product_name_nan = df_prods[df_prods['product_name'].isnull() == True]
print('Total number of Nan cells in product_name column is', df_product_name_nan.shape[0] )
print('\n\n',df_product_name_nan)

df_prods.dropna(subset = ['product_name'], inplace = True)

print('After nan delete total number of cells in product_name column is',df_prods['product_name'].isnull().sum())

Total number of Nan cells in product_name column is 16


        product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14   12.20
68             69          NaN        26              7   11.80
115           116          NaN        93              3   10.80
261           262          NaN       110             13   12.10
525           525          NaN       109             11    1.20
1511         1511          NaN        84             16   14.30
1780         1780          NaN       126             11   12.30
2240         2240          NaN        52              1   14.20
2586         2586          NaN       104             13   12.40
3159         3159          NaN       126             11   13.10
3230         3230          NaN       120             16   14.40
3736         3736          NaN        41              8   14.80
4283         4283          NaN        77              7   14.40
4790         4790          NaN        91             16   14.50
38187       38183          NaN        39             12   20.90
40444       40440          NaN       120             16   14.80
After nan delete total number of cells in product_name column is 0

In [17]:
#Run a check for duplicate values in your df_ords data.
#In a markdown cell, report your findings and propose an explanation for any duplicate values you find.
df_orders_dups = df_orders[df_orders.duplicated()]
df_orders_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [18]:
df_products_dups = df_prods[df_prods.duplicated()]
df_products_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.80
18459,18458,Ranger IPA,27,5,9.20
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.40
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.80
35495,35491,Adore Forever Body Wash,127,11,9.90

In [19]:
print('Total number of records before removing duplicate values', df_prods.shape[0])

df_prods = df_prods.drop_duplicates()

print('Total number of records after removing duplicate values', df_prods.shape[0])

Total number of records before removing duplicate values 49677
Total number of records after removing duplicate values 49672

In [20]:
#Print the number of rows and columns in the df_prods dataframe.
dimension = df_prods.shape
print('rows:',dimension[0])
print('column:',dimension[1])

rows: 49672
column: 5

In [23]:
#Print the number of rows and columns in the df_prods dataframe.
dimension = df_orders.shape
print('rows:',dimension[0])
print('column:',dimension[1])

rows: 3421083
column: 6

In [22]:
# 9
#Export your final, cleaned df_prods and df_ords data as “.csv” files in your “
#Prepared Data” folder and give them appropriate, succinct names.
#
#

df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'), index=False)
df_orders.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'), index=False)

print('Dataframe exported to csv file')

Dataframe exported to csv file